<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"staging","backend":"a1ab4ac8e099639927eccdcfba36e6cfa6888b78ee0b3701c461b35750d0f3b4","plan_job_ref":"Job Pull Request Checks #3298 at https://github.com/GSA-TTS/FAC/actions/runs/9906485710","plan_out_hash":"8bf165b96bb71845ece2b91a66696fd524e7a9d2137eb8cb2ba164713b99afdf","plan_hash":"58112913486756f185bd44ff3031f6dfc032ae94cd3fad02a5bc245328134299","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 1 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # module.staging.module.https-proxy.cloudfoundry_app.egress_app will be updated in-place
!~  resource "cloudfoundry_app" "egress_app" {
        id                              = "1c9e7877-3c69-4fe5-8541-7bca3f845eb1"
        name                            = "https-proxy"
!~      source_code_hash                = "9fcf4a7f6abfc9a220de2b8bb97591ab490a271ac0933b984f606f645319e1a4" -> "9b63bf9766c73480bf1c2385e259b1321988ede71a7b68ebe5c451d9ff6bf1c1"
#        (21 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.staging.module.newrelic.newrelic_one_dashboard.log_review_dashboard will be created
+   resource "newrelic_one_dashboard" "log_review_dashboard" {
+       account_id  = (known after apply)
+       guid        = (known after apply)
+       id          = (known after apply)
+       name        = "FAC Log Review (staging)"
+       permalink   = (known after apply)
+       permissions = "public_read_only"

+       page {
+           guid = (known after apply)
+           name = "FAC Log Review"

+           widget_billboard {
+               column         = 1
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 1
+               title          = "Submission Count"
+               width          = 3

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "From Transaction SELECT count(*) as 'Submissions' WHERE appName = 'gsa-fac-staging' and request.method = 'POST' and request.uri like '/audit/submission/%' since 1 week ago"
                }
            }
+           widget_billboard {
+               column         = 4
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 1
+               title          = "Excel Uploads"
+               width          = 3

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "FROM Metric SELECT count(*) AS 'Total uploads', average(apm.service.transaction.duration) AS 'Average time (s)' WHERE appName = 'gsa-fac-staging' AND path LIKE 'audit.views.views:ExcelFileHandlerView.post'"
                }
            }
+           widget_billboard {
+               column         = 7
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 1
+               title          = "Single Audit Report Uploads"
+               width          = 3

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "FROM Metric SELECT count(*) AS 'Total uploads', average(apm.service.transaction.duration) AS 'Average time (s)' WHERE appName = 'gsa-fac-staging' AND path LIKE 'audit.views.upload_report_view:UploadReportView.post'"
                }
            }
+           widget_billboard {
+               column         = 10
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 1
+               title          = "Global Requests (Non-Upload)"
+               width          = 3

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "FROM Metric SELECT count(*) AS 'Total requests', average(apm.service.transaction.duration) * 1000 AS 'Average time (ms)' WHERE appName = 'gsa-fac-staging' AND path NOT LIKE '%ExcelFileHandlerView.post' AND path NOT LIKE '%UploadReportView.post'"
                }
            }
+           widget_billboard {
+               column         = 9
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 4
+               title          = "Infected Files Detected"
+               width          = 3

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "SELECT count(*) AS 'Infected Files' FROM Log WHERE tags.space_name = 'staging' and message LIKE '%ScanResult.INFECTED%'"
                }
            }
+           widget_billboard {
+               column         = 9
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 5
+               title          = "Django /admin/login/ Count"
+               width          = 3

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "SELECT count(`message` as `/admin/login/ hits`) FROM Log WHERE `message` LIKE 'fac-staging.app.cloud.gov%/admin/login%' SINCE 7 days ago"
                }
            }
+           widget_billboard {
+               column         = 9
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 6
+               title          = "staging api.sam.gov Connection Count"
+               width          = 3

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "SELECT count(*) AS 'api.sam.gov connections' FROM Log WHERE `entity.name` = 'gsa-fac-staging' AND allColumnSearch('api.sam.gov', insensitive: true) SINCE 7 DAYS AGO"
                }
            }
+           widget_billboard {
+               column         = 9
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 7
+               title          = "staging login.gov Connection Count"
+               width          = 3

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "SELECT count(*) AS 'login.gov connections' FROM Log WHERE `entity.name` = 'gsa-fac-staging' AND allColumnSearch('/api/openid_connect/userinfo', insensitive: true) SINCE 7 DAYS AGO"
                }
            }

+           widget_log_table {
+               column         = 1
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 6
+               title          = "staging api.sam.gov Connections"
+               width          = 8

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "SELECT `message` FROM Log WHERE `entity.name` = 'gsa-fac-staging' AND allColumnSearch('api.sam.gov', insensitive: true) SINCE 7 DAYS AGO"
                }
            }
+           widget_log_table {
+               column         = 1
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 7
+               title          = "staging login.gov Connections"
+               width          = 8

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "SELECT `message` FROM Log WHERE `entity.name` = 'gsa-fac-staging' AND allColumnSearch('/api/openid_connect/userinfo', insensitive: true) SINCE 7 DAYS AGO"
                }
            }

+           widget_stacked_bar {
+               column         = 1
+               height         = 4
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 3
+               title          = "500 Error Code"
+               width          = 12

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "SELECT count(*) FROM Transaction FACET `request.uri` WHERE response.status = '500' and appName = 'gsa-fac-staging' SINCE 1 week AGO TIMESERIES"
                }
            }
+           widget_stacked_bar {
+               column         = 1
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 4
+               title          = "Login Requests"
+               width          = 8

+               colors {
+                   color = "#00ff04"

+                   series_overrides {
+                       color       = "#00ff04"
+                       series_name = "/openid/login/"
                    }
                }

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "SELECT count(*) FROM Transaction FACET `request.uri` WHERE request.uri = '/openid/login/' and appName = 'gsa-fac-staging' SINCE 1 week AGO TIMESERIES"
                }
            }
+           widget_stacked_bar {
+               column         = 1
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 5
+               title          = "Logout Requests"
+               width          = 8

+               colors {
+                   color = "#ff0000"

+                   series_overrides {
+                       color       = "#ff0000"
+                       series_name = "/openid/logout/"
                    }
                }

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "SELECT count(*) FROM Transaction FACET `request.uri` WHERE request.uri = '/openid/logout/' and appName = 'gsa-fac-staging' SINCE 1 week AGO TIMESERIES"
                }
            }
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.staging-backups-bucket.cloudfoundry_service_instance.bucket,
  on /tmp/terraform-data-dir/modules/staging-backups-bucket/s3/main.tf line 14, in resource "cloudfoundry_service_instance" "bucket":
  14:   recursive_delete = var.recursive_delete

Since CF API v3, recursive delete is always done on the cloudcontroller side.
This will be removed in future releases

(and 6 more similar warnings elsewhere)
```
</details>

:memo: Plan generated in [Pull Request Checks #3298](https://github.com/GSA-TTS/FAC/actions/runs/9906485710)